---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.GetFieldCount
source: html/ccf39e57-51ce-c2ce-adcb-78cdc610f60b.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.GetFieldCount Method

Gets the number of fields in this ScheduleDefinition.

## Syntax (C#)
```csharp
public int GetFieldCount()
```

## Returns
The number of fields.